Revit 2018 API
IFCImportOptions Methods
The IFCImportOptions type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetConversionData
 Get the data used in the creation of the associated Revit file for an IFC link operation, if it exists.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
IFCImportOptions Class
Autodesk.Revit.DB.IFC Namespace